# "HM less1 task1"
str_1 = "my first programm on Python"  #текст в двойных кавычках, переменная строковая
str_2 = 'My first symbol code'  #текст в одинарных кавычках, переменная строковая

var_1 = 3 #целочисленная (int)
var_2 = 12.3 #число с плавающей точкой (float)

print(str_1)
print(var_2)

print("программа сложения чисел")
# ввод данных пользователем
my_var_1 = float(input("Введите первое слагаемое цифрами\n"))
my_var_2 = float(input("Введите второе слагаемое цифрами\n"))
my_summ = my_var_1 + my_var_2 #формула операции
print("Сумма чисел =" , my_summ) #вывод результатов выполнения для пользователя
